app/views/authors/index.html.erb

<ul>
<% Author.all.each do |author| %>
---
SELECT "authors".* FROM "authors"