app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-08-04 18:27:59.257276"], ["updated_at", "2016-08-04 18:27:59.257276"]]
---
  def create
    @author = Author.new
    @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @author = Author.find(params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "authors" SET "name" = ?, "hometown" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "Peter Sagan"], ["hometown", "Slovakia"], ["updated_at", "2016-08-04 18:30:25.943945"], ["id", 3]]
---
  def update
    @author = Author.find(params[:id])
    @author.update(name: params[:name], hometown: params[:hometown])